/*
一、单一职责原则 SRP
    1. 代理模式
    2. 迭代器模式
    3. 单例模式
    4. 装饰者模式

二、最少知识原则 LKP / Law of Demeter
    1. 中介者模式
    2. 外观模式（JS用的不多）：定义了一个高层接口，为子系统中的一组接口提供一个一致的界面，使子系统更易使用

三、开放-封闭原则 OCP
    1. 发布-订阅模式
    2. 模板方法模式
    3. 策略模式
    4. 代理模式
    5. 职责链模式

    · 利用对象的多态性消除条件分支
    · 放置挂钩 hook
    · 使用回调函数

四、接口和面向接口编程：接口是对象能响应的请求的集合
    使用抽象类和interface：通过向上转型来隐藏对象的真正类型，以表现对象的多态性；约定类与类之间的一些契约行为

五、代码重构
    1. 提炼函数
    2. 合并重复的条件片段
    3. 把条件分支语句提炼成函数
    4. 合理使用循环
    5. 提前让函数退出代替嵌套条件分支
    6. 传递对象参数代替过长的参数列表
    7. 尽量减少参数数量
    8. 少用三目运算符
    9. 合理使用链式调用
    10. 分解大型类
    11. 用return退出多重循环 
*/
